export const checkout = {
  steps: {
    step1: {
      title: "Крок 1/7",
      description: "Особисті дані"
    },
    step2: {
      title: "Крок 2/7",
      description: "Попередня пропозиція"
    },
    step3: {
      title: "Крок 3/7",
      description: "Вибір продавця"
    },
    step4: {
      title: "Крок 4/7",
      description: "Додавання оригінальних документів"
    },
    step5: {
      title: "Крок 5/7",
      description: "Вибір методу оплати страховки"
    },
    step6: {
      title: "Крок 6/7",
      description: "Фінальна пропозиція"
    },
    step7: {
      title: "Крок 7/7",
      description: "Підпис документів"
    },
  },
  personalInfo: {
    userInfo: {
      personalData: 'Особисті дані',
      inn: {
        label: 'ІНН',
        placeholder: 'Введіть ІІН тут'
      },
      phoneNumber: {
        label: 'Номер телефону',
        placeholder: '+7 (000) 000-00-00'
      },
      email: {
        label: 'Email',
        placeholder: 'Адреса пошти'
      },
      validation: {
        enterIin: "Введіть ІІН",
        validIin: "Введіть дійсний ІІН",
        enterPhoneNumber: "Вкажіть номер телефону",
        validEmail: "Введіть дійсну електронну адресу",
        enterEmail: "Введіть електронну адресу",
        longEmail: 'Email повинен містити не більше 50 символів'
      }
    },
    gotMarried: {
      married: 'Перебуваю у шлюбі',
      phoneNumber: {
        label: 'Номер телефону партнера',
        placeholder: 'Введіть номер телефону',
      },
      marriageCertificate: 'Свідоцтво про шлюб',
      maxSizePdf: 'Файл має бути у форматі PDF і розміром не більше 5 мб',
    },
    hasChildren: {
      title: 'Є діти',
      numberOfChildren: 'Кількість дітей до 18 років',
      selectQuantity: 'Виберіть кількість',
    },
    confirmRules: {
      isPersonalData: {
        first: 'Я погоджуюся на збір та обробку ',
        second: 'Персональних даних ',
        third: 'і ',
        forth: 'Кредитної історії'
      },
      isPublicPerson: {
        first: 'Я не є ',
        second: 'іноземним публічним посадовою особою',
      },
      isForeignAccounts: {
        first: 'На мене не поширюється ',
        second: 'положення «Закону Про податковий контроль іноземних рахунків» у США',
      },
      isFATCA: {
        first: 'Я підтверджую відсутність у мене ',
        second: 'ознак приналежності до FATCA',
      },
      isProductTerms: {
        first: 'Я підтверджую що ознайомився з',
        second: 'Умовами продукту',
      },
      isProductTariffs: {
        first: 'Я погоджуюся з відкриттям рахунку ',
        second: 'Умови та тарифи',
      },
    },
    acceptDocs: {
      title: "Підтвердження даних",
      desc: "Для надання тимчасового доступу банку до вашого паспорта, будь ласка, підтвердіть свої дані через Dia",
      label: "Водійське посвідчення",
      docType: "Документ",
      licence: "Водійське посвідчення",
      passport: 'Паспорт',
      smsMessage: "Ми надіслали вам SMS на ваш номер телефону. Перейдіть за посиланням на вашому телефоні в Dia і підтвердіть дію",
      docConfirmed: "Документи успішно підтверджені",
      noLicense: "У мене немає прав",
      manualUpload: "Завантажити вручну",
      confirmDia: "Підтвердити в Dia",
      successMessage: "Ви успішно надіслали запит на підтвердження документа!",
      uploadSuccessMessage: "Ваші водійські права успішно завантажено!",
      skipSuccessMessage: "Завантаження водійських прав успішно пропущено!"
    },
    otp: {
      title: 'Введіть код із SMS',
      codeSent: 'Код відправлений на номер',
      reply: 'Переотправіть код через',
      resendCode: 'Надіслати код повторно',
    },
    salaryInfo: {
      title: 'Дані про доходи',
      informationBelow: 'Заповніть будь ласка дані нижче',
      selectEmployment: 'Виберіть тип зайнятості',
      employee: 'Найманий працівник',
      fop: 'ФОП',
      income: 'Дохід',
      incomeDocument: 'Документ про доходи',
      incomeDataLabel: 'Дані про доходи',
      workPlace: 'Місце роботи:',
      fopDeclaration: "Декларація ФОП",
      activityType: "Вид діяльності",
      select: "Вибрати",
      incomeInfo: "Вкажіть дані про доходи",
      quarterly: "Поквартально",
      yearly: "За рік",
      quarterIncome: "Дохід за квартал",
      lastYearIncome: "Дані за останній рік",
      incomeDataSuccess: 'Ви успішно надіслали дані про доходи!',
      incomeDataError: 'Помилка відправлення даних про доходи.',
      incomeDocumentPlaceholder: 'Прикріпіть документ або фото з ДІЯ (форма ОК5/7)',
    },
    steps: {
      step1: {
        title: "Крок 1/4",
        description: "Особисті дані"
      },
      step2: {
        title: "Крок 2/4",
        description: "Перевірка документів"
      },
      step3: {
        title: "Крок 3/4",
        description: "Дані про доходи"
      },
      step4: {
        title: "Крок 4/4",
        description: "Підпис документів"
      }
    },
    preOffer: {
      title: 'Заявку попередньо схвалено банком',
      informationBelow: 'Будь ласка, переконайтеся в коректності даних',
      successMessage: 'Заявку попередньо схвалено банком!',
      loanAmount: 'Сума позики',
      monthlyPayment: 'Щомісячний платіж',
      initialPayment: 'Початковий внесок',
      autoCost: 'Вартість авто',
      interestRate: 'Ставка',
      loanTerm: 'Термін кредиту',
      years: 'років',
      repaymentScheme: 'Схема виплати',
      cascoCost: 'Вартість КАСКО',
      osagoCost: 'Вартість ОСАГО',
      commission: 'Комісія',
      annuity: 'Аннуїтет',
      equalShares: 'Рівними частками',
      repaymentMethod: "Метод погашення",
      creditTerm: "Термін кредиту",
      realRate: "Реальна ставка",
      needToArrangeSeparately: "Потрібно оформити окремо",
      vehiclePrice: 'Вартість авто',
      asPartOfLoan: 'Включити у вартість кредиту',
      separately: 'Оплатити особистими коштами',
      changeLoanTerms: 'Змінити умови кредиту',
      calculation: {
        changeTerms: 'Змінити умови',
        save: 'Зберегти'
      }
    },
    selectAuto: {
      sellerData: 'Дані продавця',
      finalDecision: 'Для отримання фінального рішення, необхідно вибрати дилера і потім отримати згоду продавця.',
      informSeller: 'Попередьте продавця, що йому прийде SMS з посиланням на підтвердження особи для завершення перевірки банком.',
      sellerPhone: "Номер телефону продавця",
      vinCode: "VIN код авто",
      enterVinCode: "Введіть VIN код авто",
      sendSms: "Відправити СМС",
      companyName: "Назва компанії",
      phoneNumber: "Номер телефону",
      city: "Місто",
      selectFromList: "Виберіть зі списку",
      successMessage: "Success",
    },
    waitAutoDealer: {
      underwriter: 'ризиківника',
      dealer: 'дилера',
      creditAdmin: 'кредитного адміністратора',
      partner: 'партнера',
      admin: 'адміна',
      waitResponseFrom: 'Чекайте на відповідь від',
      SCORING: {
        title: 'Проводяться банківські перевірки',
        desc: 'Ми дамо вам знати у вигляді СМС, коли банк закінчить перевірку'
      },
      CRED_ADMIN_DOCUMENT_GENERATION: {
        title: 'Очікуйте відповідь від кредитного адміністратора',
        desc: 'Ми дамо вам знати, коли кредитний адміністратор пройде перевірку банку. Пізніше ви можете увійти в Особистий кабінет через номер телефону, і продовжити процес автокредитування'
      },
      WAITING_UNDERWRITER_CABINET: {
        title: 'Чекайте відповідь від пошуковика',
        desc: 'Ми дамо вам знати, коли ризиковика пройде перевірку банку. Пізніше ви можете увійти в Особистий кабінет через номер телефону, і продовжити процес автокредитування'
      },
      WAITING_FILLING_PARTNER_DATA: {
        title: 'Очікуйте відповідь від партнера',
        desc: 'Ми повідомимо вас, коли ваш партнер підтвердить введені вами дані. Пізніше ви можете увійти в Особистий кабінет через номер телефону, і продовжити процес автокредитування'
      },
      WAITING_PARTNER_UPLOAD_ORIGINAL_DOCUMENTS: {
        title: 'Очікуємо, коли партнер завантажити документи',
        desc: 'Надішлемо вам повідомлення на телефон, коли Ваш(-а) чоловік (- а) Завантажити документи. Далі можна буде продовжити процес з того місця, де зупинилися.'
      },
      FILLING_DEALER_DATA: {
        title: 'Очікуйте відповідь від автодилера',
        desc: 'Ми дамо вам знати, коли автодилер пройде перевірку банку. Пізніше ви можете увійти в Особистий кабінет через номер телефону, і продовжити процес автокредитування',
      },
      BORROWER_WAITING_DIYA_SHARING_TECH_PASSPORT: {
        title: 'Очікуємо, отримання техпаспорта авто',
        desc: 'Надішлемо вам повідомлення на телефон, для підтвердження документа. Далі можна буде продовжити процес з того місця, де зупинилися.'
      },
      DEALER_CABINET: {
        title: 'Очікуйте відповідь від автодилера',
        desc: 'Ми дамо вам знати, коли автодилер пройде перевірку банку. Пізніше ви можете увійти в Особистий кабінет через номер телефону, і продовжити процес автокредитування',
      },
      notifyYou: 'Ми повідомимо вам, коли автодилер пройде перевірку банком. Пізніше ви зможете увійти до особистого кабінету за номером телефону та продовжити процес автокредитування.',
      home: 'На головну'
    },
    errorCase: {
      REJECTED: {
        title: "Упс..",
        desc: "На жаль, ми не можемо наразі схвалити автокредит на поточних умовах. Але ми підготували для вас альтернативні рішення, просимо їх розглянути."
      },
      home: "Повернутися на головну",
      alternatives: "Переглянути альтернативні рішення"
    },
    originalDocuments: {
      title: 'Завантаження оригінальних документів',
      hiredLabel: 'Довідка з місця роботи',
      additionalLabel: 'Додаткові документи про доходи',
      maxSizePdf: 'Файл повинен бути у форматі PDF і розміром не більше 5 МБ',
      successMessage: 'Ви успішно завантажили документи'
    },
    guarantorInfo: {
      notify: 'Повідомте поручителя, що йому прийде SMS з посиланням для підтвердження особистих даних та згоди бути Вашим співпозичальником. Посилання активне 24 години.',
      inn: {
        label: 'ІНН',
        placeholder: 'Введіть ІІН тут'
      },
      phoneNumber: {
        label: 'Номер телефону',
        placeholder: '+7 (000) 000-00-00',
      },
      sendSms: "Відправити SMS",
      smsSent: "SMS відправлено!",
      awaitingAgreement: "Очікуємо отримання згоди співпозичальника",
      agreementReceived: "Згода співпозичальника отримана!",
    },
    finalOffer: {
      title: 'Підсумкові дані',
      description: 'Вам схвалено кредит на таких умовах, перевірте всі дані перед здійсненням оплати початкового внеску.',
      successMessage: 'Ви успішно підтвердили остаточне рішення',
      errorMessage: 'Помилка при підтвердженні остаточного рішення',
    },
    documentsContent: {
      title: 'Підписання документів',
      description: 'Всі документи необхідно підписати з 9: 00 до 21: 00. Якщо ви не встигли, то можете підписати документи на наступний день в зазначений час. Документи потрібно підписати в Діа',
      contracts: 'Договори',
      paymentSchedule: 'Графік платежів',
      instructions: 'Доручення та розпорядження',
      loanAgreement: 'Договір банківського кредиту',
      pledgeAgreement: 'Договір застави',
      paymentScheduleTitle: 'Графік платежів',
      accountOpening: 'Відкриття поточного рахунку',
      paymentOrder: 'Платіжне доручення на переказ грошей на рахунок продавця',
      successMessage: 'Документи успішно підписані',
      errorMessage: 'Помилка при підписанні документів',
    },
    diyaSharingTechPassport: {
      title: 'Нам потрібно перевірити ваш техпаспорт',
      description: 'Щоб переконатися у вашій особі, ми перевіримо ваші документи через електронний сервіс державних послуг Dia. Ми не передамо ваші документи третім особам.',
      requestingParty: 'Запитуюча сторона',
      documents: 'Документи',
      bankName: 'SkyBank',
      documentTypes: 'Паспорт та водійські права',
      provideDocuments: 'Надати документи',
      smsSent: 'Ми відправили вам СМС на ваш номер телефону. Перейдіть за посиланням на вашому телефоні в Dia та підтвердіть дію.',
      documentsConfirmed: 'Документи успішно підтверджені',
      successMessage: 'Ви успішно підтвердили ваші документи!',
    },
  },
  choiceInsurance: {
    title: 'Виберіть метод оплати страхової',
    cascoCost: "Вартість КАСКО",
    banksCommission: "Комісія Банку",
    osago: {
      desc: 'Вартість ОСАГО',
      value: 'Потрібно оформити окремо'
    },
    asPartOfLoan: 'Включити у вартість кредиту',
    separately: 'Оплатити особистими коштами',
  },
  paymentOfInsurance: {
    title: 'Выбор и оплата страховой',
    date: {
      title: 'Дата сделки',
      placeholder: 'Выберите дату из календаря',
      todayButton: 'Сегодня'
    },
    insurance: {
      title: 'Страховая компания',
      placeholder: 'Выберите из списка',
    }
  }
};
